<template>
  <div id="container">
    <TopBtn/>
    <!-- Sub Visual -->
    <SubVisual :subTopCont="subTopCont"/>
    <!-- Content -->
    <div id="contents_body">
      <div class="content">
        <div class="inner">
          <div class="tab__menu">
            <button 
              type="button" 
              class=""
              :class="{active : selectedButton === 'btn1'}"
              @click="changeBtn('btn1')"
            >이용약관</button>
            <button 
              type="button"
              :class="{active : selectedButton === 'btn2'}"
              @click="changeBtn('btn2')"
            >개인정보처리방침</button>
          </div>
          <!-- 이용 약관 -->
          <div id="useAgree" :class="{active : selectedButton === 'btn1'}" class="tab__content">
            <h4>회원 등록 약관</h4>
            <div class="cont">
              <strong>제 1 조 (목적)</strong>
              <p>이 규칙은 본 사이트의 회원가입에 대한 조건 및 절차와 기타 필요한 사항을 규정함을 목적으로 합니다.</p>
            </div>
            <div class="cont">
              <strong>제 2 조 (규칙의 효력 및 변경)</strong>
              <p>① 이 규칙의 내용은 회원가입시 동의와 공지에 의해서 효력을 발생합니다.</p>
              <p>② 본 사이트 운영위가 필요하다고 인정되는 경우 이 규칙의 내용을 개정(변경, 삭제 또는 추가) 할 수 있으며, 개정된 규칙은 상기 제①항과 같은 방법으로 효력을 발생합니다.</p>
            </div>
            <div class="cont">
              <strong>제 3 조 (규칙 외 준칙)</strong>
              <p>이 규칙에 명시되지 않은 사항은 전기통신기본법, 전기 통신사업법 및 기타 관련법령의 규정에 의합니다.</p>
            </div>
            <div class="cont">
              <strong>제 4 조 (회원의 범위)</strong>
              <p>① 회원가입을 한자에 한해 회원됨을 원칙으로 합니다.</p>
              <p>② 비회원은 특정 영역의 게시판을 사용하실 수 없습니다.</p>
              <p>③ 회원이라 함은 회원과 비회원을 통칭합니다.</p>
              <p>④ 기타 언급되지 않은 사항은 일반 통상적 회원가입 기준을 따릅니다.</p>
            </div>
            <div class="cont">
              <strong>제 5 조 (회원의 의무)</strong>
              <p>① 회원은 이 규칙에서 규정하는 사항과 공지된 사항을 준수하여야 합니다.</p>
              <p>② 정식 회원은 아래 각 호의 행위를 하여서는 안됩니다.</p>
              <p class="sub">1. 정당한 이유없이 타인의 명예를 손상시키거나 권리를 침해하는 행위</p>
              <p class="sub">2. 공공질서 또는 미풍양속을 해하는 행위</p>
              <p class="sub">3. 본 사이트의 명예를 손상시키거나 운영을 방해하는 행위</p>
              <p class="sub">4. 국가안전을 위협하거나 범죄와 결부된다고 인정되는 행위</p>
              <p class="sub">5. 본 규칙에 위반하여 회원활동을 하는 행위</p>
              <p class="sub">6. 기타 현행법에 위배되는 행위</p>
            </div>
            <div class="cont">
              <strong>제 6 조 (회원가입 제한)</strong>
              <p>다음 각호에 해당되는 경우 사전 경고없이 해당 회원에 대해 삭제, 이동, 이용자 접근 제한, 이용 정지 등의 조치를 취할 수 있습니다.</p>
              <p>① 제 5 조에 의한 회원의 의무를 위반하였을 경우</p>
              <p>② 게시판에 불법 성인물 및 음란물을 게시하거나 링크하는 경우</p>
              <p>③ 게시판에 저작권 및 저작인접권을 침해하는 내용을 게시하거나 링크하는 경우</p>
              <p>④ 회원가입 시 거짓 정보를 기입한 경우</p>
              <p>⑤ 회원의 동의 없이 상업적 광고성 글을 게제하는 경우</p>
            </div>
            <div class="cont">
              <strong>제 7 조 (게시판 글의 저작권)</strong>
              <p>① 게시판에 게시한 글의 저작권에 대한 일체의 권리는 해당 글의 게시자에게 있습니다.</p>
              <p>② 게시판의 글과 관련한 모든 법적인 문제에 대한 책임은 해당 글의 게시자에게 있습니다.</p>
            </div>
            <div class="cont">
              <strong>제 8 조 (내용의 변경 및 추가)</strong>
              <p>본 운영위가 필요하다고 판단하는 경우 본 홈페이지의 내용을 추가, 변경 또는 삭제할 수 있으며 그 내용을 홈페이지내에 게시하거나 별도로 공지합니다.</p>
            </div>
            <div class="cont">
              <strong>제 9 조 (관리 운영자의 의무)</strong>
              <p>회원가입과 관련하여 알게 된 회원의 신상정보를 본인의 승낙없이 타인에게 누설, 배포하거나 상업적 목적으로 사용할 수 없습니다.</p>
              <p>단, 관계 법령에 근거하여 관계 기관의 요구가 있는 경우, 운영위의 토의에 의해서 이에 응할 수 있습니다.</p>
            </div>
            <div class="cont">
              <strong>제 10 조 (본 사이트의 관리)</strong>
              <p>① 게시판에 글을 게시, 변경, 삭제의 책임은 해당 글의 게시자에게 있습니다.</p>
              <p>② 게시판 글의 손망실에 대비한 원본 및 사본 유지(백업)의 책임은 해당 글의 게시자에게 있습니다.</p>
              <p>③ 특정 회원 및 비회원의 게시한 글이 본 사이트의 운영에 타격을 준다고 판단할 경우, 해당 글의 게시자에게 시정을 권고하거나 해당 글의 게시자에 대한 접근을 차단할 수 있습니다. 이 경우, 접근차단 즉시 해당 글의 게시자에게 접근차단 사실을 통보하여야 합니다.</p>
            </div>
            <div class="cont">
              <strong>제 11조 (손해배상 및 면책)</strong>
              <p>① 회원은 본 사이트에서 허용하지 않은 행위 또는 활동으로 인한 모든 결과 및 손실에 대한 책임은 해당 회원에게 있으며, 본 사이트는 책임을 지지 않습니다.</p>
              <p>② 회원 또는 본 사이트 운영위는 천재지변, 불가항력적인 사유으로 인하여 본 규칙에서 정하는 바를 위반하게 될 경우, 해당 책임을 지지 않습니다.</p>
              <p>③ 본 홈페이지 운영의 중단으로 인하여 회원에게 발생할 수 있는 제반 손해에 대하여 배상할 책임을 지지 않습니다.</p>
              <p>④ 회원의 귀책사유로 인한 본 사이트 운영장애에 대하여 책임을 지지 않으며 이로 인해 본사가 입는 손해는 해당 회원이 배상하여야 합니다.</p>
              <p>⑤ 당사는 회원에게 제공, 게시 또는 전송한 자료의 신뢰도, 정확성 등의 사항에 관하여 책임을 지지 않습니다.</p>
            </div>
          </div>
          <!--	-->
          <div id="information" :class="{active : selectedButton === 'btn2'}" class="tab__content">
            <h4>개인정보 처리방침</h4>
            <div class="cont">
              <h5>1. 개인정보의 처리 목적 대전세잔직업전문학교(‘<a href="http://www.djcezanne.co.kr/" target="_blank">http://www.djcezanne.co.kr/</a>’이하 ‘대전세잔직업전문학교’) 은(는) 다음의 목적을 위하여 개인정보를 처리하고 있으며, 다음의 목적 이외의 용도로는 이용하지 않습니다.</h5>
              <p>고객 가입의사 확인, 고객에 대한 서비스 제공에 따른 본인 식별.인증, 회원자격 유지.관리, 물품 또는 서비스 공급에 따른 금액 결제, 물품 또는 서비스의 공급.배송 등</p>
            </div>
            <div class="cont">
              <h5>2. 개인정보의 처리 및 보유 기간</h5>
              <p>① '대전세잔직업전문학교'은(는) 정보주체로부터 개인정보를 수집할 때 동의 받은 개인정보 보유.이용기간 또는 법령에 따른 개인정보 보유.이용기간 내에서 개인정보를 처리.보유합니다.</p>
              <p>② 구체적인 개인정보 처리 및 보유 기간은 다음과 같습니다.</p>
              <p class="sub">☞ 아래 예시를 참고하여 개인정보 처리업무와 개인정보 처리업무에 대한 보유 기간 및 관련 법령, 근거 등을 기재합니다.</p>
              <p class="sub">(예시) - 고객 가입 및 관리 : 서비스 이용계약 또는 회원가입 해지 시까지, 다만 채권.채무관계 잔존 시에는 해당 채권.채무관계 정산 시까지</p>
            </div>
            <div class="cont">
              <h5>3. 개인정보의 제3자 제공에 관한 사항</h5>
              <p>① '대전세잔직업전문학교'은(는) 정보주체의 동의, 법률의 특별한 규정 등 개인정보 보호법 제17조 및 제18조에 해당하는 경우에만 개인정보를 제3자에게 제공합니다.</p>
              <p>② '대전세잔직업전문학교'은(는) 다음과 같이 개인정보를 제3자에게 제공하고 있습니다.</p>
              <h5 class="sub">1. 대전세잔직업전문학교</h5>
              <p class="sub">- 개인정보를 제공받는 자 : 대전세잔직업전문학교</p>
              <p class="sub">- 제공받는 자의 개인정보 이용목적 : 이메일, 휴대전화번호, 자택주소, 자택전화번호, 비밀번호, 로그인ID, 이름</p>
              <p class="sub">- 제공받는 자의 보유.이용기간 : 3년</p>
            </div>
            <div class="cont">
              <h5>4. 개인정보처리 위탁</h5>
              <p>① '대전세잔직업전문학교'은(는) 원활한 개인정보 업무처리를 위하여 다음과 같이 개인정보 처리업무를 위탁하고 있습니다.</p>
              <h5 class="sub">1.</h5>
              <p class="sub">- 위탁받는 자 (수탁자) : </p>
              <p class="sub">- 위탁하는 업무의 내용 : </p>
              <p class="sub">- 위탁 기간 : </p>
              <p>② '대전세잔직업전문학교'은(는) 위탁계약 체결시 개인정보 보호법 제25조에 따라 위탁업무 수행목적 외 개인정보 처리금지, 기술적/관리적 보호조치, 재위탁 제한, 수탁자에 대한 관리.감독, 손해배상 등 책임에 관한 사항을 계약서 등 문서에 명시하고, 수탁자가 개인정보를 안전하게 처리하는지를 감독하고 있습니다.</p>
              <p>③ 위탁업무의 내용이나 수탁자가 변경될 경우에는 지체없이 본 개인정보 처리방침을 통하여 공개하도록 하겠습니다.</p>
            </div>
            <div class="cont">
              <h5>5. 정보주체와 법정대리인의 권리·의무 및 그 행사방법 이용자는 개인정보주체로써 다음과 같은 권리를 행사할 수 있습니다.</h5>
              <p>① 정보주체는 '대전세잔직업전문학교'에 대해 언제든지 다음 각 호의 개인정보 보호 관련 권리를 행사할 수 있습니다.</p>
              <h5 class="sub">1. 개인정보 열람요구</h5>
              <h5 class="sub">2. 오류 등이 있을 경우 정정 요구</h5>
              <h5 class="sub">3. 삭제 요구</h5>
              <h5 class="sub">4. 처리정지 요구</h5>
            </div>
            <div class="cont">
              <h5>6. 처리하는 개인정보의 항목 작성</h5>
              <p>① '대전세잔직업전문학교'은(는) 다음의 개인정보 항목을 처리하고 있습니다.</p>
              <h5 class="sub">1.</h5>
              <p class="sub">- 필수 항목 : 이메일, 휴대전화번호, 자택주소, 자택전화번호, 비밀번호, 로그인ID, 생년월일, 이름</p>
              <p class="sub">- 선택 항목 : </p>
            </div>
            <div class="cont">
              <h5>7. 개인정보의 파기 '대전세잔직업전문학교'은(는) 원칙적으로 개인정보 처리목적이 달성된 경우에는 지체없이 해당 개인정보를 파기합니다. 파기의 절차, 기한 및 방법은 다음과 같습니다.</h5>
              <p class="sub">- 파기절차</p>
              <p class="sub">이용자가 입력한 정보는 목적 달성 후 별도의 DB에 옮겨져(종이의 경우 별도의 서류) 내부 방침 및 기타 관련 법령에 따라 일정기간 저장된 후 혹은 즉시 파기됩니다. 이 때, DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 다른 목적으로 이용되지 않습니다.</p>
            </div>
            <div class="cont">
              <h5>8. 개인정보 자동 수집 장치의 설치.운영 및 거부에 관한 사항</h5>
              <p>대전세잔직업전문학교 은 정보 주체의 이용정보를 저장하고 수시로 불러오는 ‘쿠키’를 사용하지 않습니다.</p>
            </div>
            <div class="cont">
              <h5>9. 개인정보 보호책임자 작성</h5>
              <p>① '대전세잔직업전문학교'은(는) 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.</p>
              <h5 class="sub">▶ 개인정보 보호책임자 </h5>
              <p class="sub">성명 : 김현주</p>
              <p class="sub">직책 : 대표</p>
              <p class="sub">직급 : 원장</p>
              <p class="sub">연락처 : <a href="tel:042-252-1153">042-252-1153</a>, <a href="mailto:djcezanne@naver.com"> djcezanne@naver.com</a></p>
              <p class="sub">※ 개인정보 보호 담당부서로 연결됩니다.</p>
              <h5 class="sub">▶ 개인정보 보호 담당부서</h5>
              <p class="sub">부서명 : </p>
              <p class="sub">담당자 : </p>
              <p class="sub">연락처 : </p>
              <p class="sub">② 정보주체께서는 '대전세잔직업전문학교'의 서비스(또는 사업)을 이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자 및 담당부서로 문의하실 수 있습니다. '대전세잔직업전문학교'은(는) 정보주체의 문의에 대해 지체 없이 답변 및 처리해드릴 것입니다.</p>
            </div>
            <div class="cont">
              <h5>10. 개인정보 처리방침 변경</h5>
              <p>① 이 개인정보처리방침은 시행일로부터 적용되며, 법령 및 방침에 따른 변경내용의 추가, 삭제 및 정정이 있는 경우에는 변경사항의 시행 7일 전부터 공지사항을 통하여 고지할 것입니다.</p>
            </div>
            <div class="cont">
              <h5>11. 개인정보의 안전성 확보 조치 '대전세잔직업전문학교'은(는) 개인정보보호법 제29조에 따라 다음과 같이 안전성 확보에 필요한 기술적/관리적 및 물리적 조치를 하고 있습니다.</h5>
              <h5 class="sub">1. 정기적인 자체 감사 실시</h5>
              <p class=sub>개인정보 취급 관련 안정성 확보를 위해 정기적(분기 1회)으로 자체 감사를 실시하고 있습니다.</p>
              <h5 class="sub">2. 개인정보에 대한 접근 제한</h5>
              <p class=sub>개인정보를 처리하는 데이터베이스시스템에 대한 접근권한의 부여,변경,말소를 통하여 개인정보에 대한 접근통제를 위하여 필요한 조치를 하고 있으며 침입차단시스템을 이용하여 외부로부터의 무단 접근을 통제하고 있습니다.</p>
            </div>
          </div>
        </div>
      </div>
    </div>
    
  </div>
</template>

<script>
  import TopBtn from './TopBtn.vue';
  import SubVisual from './SubVisual.vue';

  export default {
    components : {
      TopBtn,
      SubVisual
    },
    data() {
      return {
        selectedButton : 'btn1',
        subTopCont : {
          className : 'post',
          title : "이용약관 & 개인정보처리방침",
          url : '/agreemant/'
        }
      }
    },
    methods : {
      changeBtn(btn) {
        this.selectedButton = btn;
      }
    }
  }
</script>

<style lang="scss" scoped>
  @use '@/styles/common/agreement' as *;
</style>